; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image2 - mode
	thermograph6 - mode
	infrared3 - mode
	thermograph1 - mode
	thermograph4 - mode
	infrared9 - mode
	thermograph5 - mode
	infrared0 - mode
	infrared8 - mode
	thermograph7 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph7)
	(supports instrument0 infrared8)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph6)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(supports instrument3 infrared9)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Star5 infrared3)
	(have_image Star5 thermograph4)
	(have_image Star5 infrared8)
	(have_image Star6 image2)
	(have_image Phenomenon7 thermograph4)
	(have_image Phenomenon7 thermograph6)
	(have_image Planet8 thermograph4)
	(have_image Planet8 infrared8)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 infrared8)
	(have_image Phenomenon9 thermograph5)
))

)

; plan
1. (turn_to satellite1 groundstation2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star6)
   goals met: 0 of 12
5. (take_image satellite0 star6 instrument0 image2)
   added: (have_image star6 image2)
   goals met: 1 of 12
6. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 1 of 12
7. (take_image satellite0 star5 instrument0 infrared8)
   added: (have_image star5 infrared8)
   goals met: 2 of 12
8. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 3 of 12
9. (take_image satellite0 planet8 instrument0 infrared8)
   added: (have_image planet8 infrared8)
   goals met: 4 of 12
10. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon9 instrument0 infrared8)
   added: (have_image phenomenon9 infrared8)
   goals met: 4 of 12
12. (turn_to satellite0 star4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star4)
   goals met: 4 of 12
13. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 12
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 12
15. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 12
16. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 4 of 12
17. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 12
18. (turn_to satellite0 phenomenon7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 12
19. (take_image satellite0 phenomenon7 instrument2 thermograph6)
   added: (have_image phenomenon7 thermograph6)
   goals met: 5 of 12
20. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   goals met: 5 of 12
21. (take_image satellite0 star5 instrument2 infrared3)
   added: (have_image star5 infrared3)
   goals met: 6 of 12
22. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 6 of 12
23. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 12
24. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 12
25. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 6 of 12
26. (turn_to satellite0 phenomenon7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 12
27. (take_image satellite0 phenomenon7 instrument1 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 7 of 12
28. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 12
29. (take_image satellite0 phenomenon9 instrument1 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 8 of 12
30. (turn_to satellite0 star5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star5)
   goals met: 8 of 12
31. (take_image satellite0 star5 instrument1 thermograph4)
   added: (have_image star5 thermograph4)
   goals met: 9 of 12
32. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 10 of 12
33. (take_image satellite0 planet8 instrument1 thermograph4)
   added: (have_image planet8 thermograph4)
   goals met: 11 of 12
34. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   goals met: 11 of 12
35. (take_image satellite1 planet8 instrument3 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 12 of 12
